test/vcr/vcr_cassettes/cities_by_country_invalid_country.yml

---
http_interactions:
- request:
    method: post
    uri: http://www.webservicex.net/globalweather.asmx
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.webserviceX.NET"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:GetCitiesByCountry><tns:CountryName>FarFarFarAway</tns:CountryName></tns:GetCitiesByCountry></env:Body></env:Envelope>
    headers:
      Soapaction:
      - ! '"http://www.webserviceX.NET/GetCitiesByCountry"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '377'
      Accept:
      - ! '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private, max-age=0
      Content-Length:
      - '411'
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - Microsoft-IIS/7.0
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Sun, 25 Aug 2013 03:53:35 GMT
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetCitiesByCountryResponse
        xmlns="http://www.webserviceX.NET"><GetCitiesByCountryResult>&lt;NewDataSet
        /&gt;</GetCitiesByCountryResult></GetCitiesByCountryResponse></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Sun, 25 Aug 2013 03:53:32 GMT
recorded_with: VCR 2.5.0
